import React from "react";
import Button from 'react-bootstrap/Button'
import Jumbotron from 'react-bootstrap/Jumbotron'

const page1 = props => {
  return (
    <div  style={{margin: 50}}>
    <Jumbotron>
  <h1>Information</h1>
  <p>
  Про відкриття на станції Фастів Південно-Західних залізниць однокласного училища

Міністерства народної освіти і перетворення його в двокласне (1898 р.)

Начальник дороги 4 березня 1898 року надіслав прошеніє піклувальнику Київського учбового корпусу про відкриття у Фастові однокласного училища для дітей службовців Південно-Західних залізниць. За прикладом всіх училищ, діти службовців за право навчання платять 4 карбованці на рік, діти родичів службовців — 8 карбованців на рік. Звільняли від сплати найбідніших, що становило 25 процентів учнів школи. 

Винагорода штату вчителів пропонується в таких розмірах: законоучитель — 120 крб., завідуючий училищем — 400 крб., вчителька — 300 крб., учитель гімнастики — 60 крб.

23 березня надіслана телеграма — Київському учбовому корпусу — подяка службовців з приводу відкриття школи.

Від ЗО.03.1898 р. інспектор народних училищ писав у донесенні піклувальнику Київського губернського округу, що 29 березня відкрито однокласне училище, утримуване на кошти залізниці в пристосованому бараці, який, за заявою лікаря 7 дільниці, з 1893 року залишався без призначення. Приміщення продезинфіковано, оббито новими дошками. Прийом учнів проводитиметься два тижні. Заняття розпочнуться 13 квітня.

У Фастівське сільське однокласне училище прийнято 44 учні.

За поданням інспектора затверджено в званні почесного блюстителя Фастівського однокласного народного училища лікаря 7-Г дільниці Південно-Західних залізниць Василя Йосиповича Дашкова. Міністерство дало згоду.

1 лютого 1900 року училище переіменовано в двокласне. До 1 групи 2 класу прийнято 10 хлопчиків і 2 дівчинки.

З 1900 р. школа називається двокласною транспортною. Вона була розташована в центрі міста па розі вулиць Леніна і Толстого. В цьому приміщенні школа знаходилась до 1907 року.

В 1908 році побудовано для школи нове приміщення, в якому вона знаходиться і зараз. Як двокласнатранспортна вона проіснувала до революції 1917 року. Завідувачем школи до 1910 р. був Саноцький Олександр Михайлович, а з 1910 року — Ніцкевич Іван Андрійович. Після жовтневої революції на базі школи відкрилась реальна гімназія. З 1920 року вона перетворюється в соціально-економічну середню школу. З 1923 р. в трудову семирічну, з 1925 р. — в середню фабрично-заводську десятирічну (ФЗД). Перший випуск 10 класу відбувся 1936 року. Під час війни приміщення школи було наполовину зруйновано

В 1990 році побудовано сучасне приміщення школи.
  </p>
  <p>
    <Button variant="primary">Learn more</Button>
  </p>
</Jumbotron>      
    
    </div>
  );
};

export default page1;
